In [1]:
import pandas as pd
import numpy as np

In [3]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [7]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [11]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Date

In [14]:
date['date'] = pd.to_datetime(date['date'])

In [16]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [18]:
date.head(2)

        date  product_id  city_id  orders
0 2019-12-10        5628       25       3
1 2018-08-15        3646       14     157

# 1.Extracting Year

In [21]:
date['dater_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  dater_year
405 2019-07-26        4207        0       1        2019
91  2018-09-18         923       13       1        2018
869 2018-12-30        2542        0       2        2018
196 2018-08-20        6215       22       4        2018
976 2019-04-18        5320       13       1        2019

# 2. Extracting Month

In [24]:
date['date_month'] = date['date'].dt.month

date.sample(5)

          date  product_id  city_id  orders  dater_year  date_month
627 2018-08-01        4568       13     138        2018           8
475 2019-07-25        2898       18      98        2019           7
539 2019-12-08        2831       16       4        2019          12
78  2019-05-28        3044        7       7        2019           5
597 2018-10-18        4846        1       1        2018          10

In [26]:
date['date_month'] = date['date'].dt.month_name()

date.sample(5)

          date  product_id  city_id  orders  dater_year date_month
676 2018-09-27        6264       25      11        2018  September
74  2019-11-13        2199       14       2        2019   November
469 2019-11-15        5549       28       2        2019   November
710 2019-02-28         128       12       1        2019   February
836 2018-07-17        2430       23       4        2018       July

# 3. Extracting Day

In [29]:
date['date_days'] = date['date'].dt.day

date.sample(5)

          date  product_id  city_id  orders  dater_year date_month  date_days
928 2019-01-02        5371       22       4        2019    January          2
2   2018-10-23        1859       25       1        2018    October         23
89  2019-07-09        7214       22       4        2019       July          9
525 2019-06-13        2249       20       2        2019       June         13
240 2019-08-09        4938       28       2        2019     August          9

In [31]:
date['date_daysofweek'] = date['date'].dt.dayofweek

date.sample(5)

,date,product_id,city_id,orders,dater_year,date_month,date_days,date_daysofweek
15,2019-02-14,202,2,4,2019,February,14,3
448,2018-12-07,1933,21,17,2018,December,7,4
906,2019-02-18,5428,26,1,2019,February,18,0
533,2019-01-22,6291,27,1,2019,January,22,1
382,2018-09-30,1935,2,48,2018,September,30,6

In [33]:
# Days od week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id', 'city_id', 'orders']).head()

        date  dater_year date_month  date_days  date_daysofweek date_dow_name
0 2019-12-10        2019   December         10                1       Tuesday
1 2018-08-15        2018     August         15                2     Wednesday
2 2018-10-23        2018    October         23                1       Tuesday
3 2019-08-17        2019     August         17                5      Saturday
4 2019-01-06        2019    January          6                6        Sunday

In [35]:
# Is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id', 'orders']).head()

,date,city_id,dater_year,date_month,date_days,date_daysofweek,date_dow_name,date_is_weekend
0,2019-12-10,25,2019,December,10,1,Tuesday,0
1,2018-08-15,14,2018,August,15,2,Wednesday,0
2,2018-10-23,25,2018,October,23,1,Tuesday,0
3,2019-08-17,25,2019,August,17,5,Saturday,1
4,2019-01-06,25,2019,January,6,6,Sunday,1

# Extract Quarter

In [40]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,dater_year,date_month,date_days,date_daysofweek,date_dow_name,date_is_weekend,quarter
0,2019-12-10,2019,December,10,1,Tuesday,0,4
1,2018-08-15,2018,August,15,2,Wednesday,0,3
2,2018-10-23,2018,October,23,1,Tuesday,0,4
3,2019-08-17,2019,August,17,5,Saturday,1,3
4,2019-01-06,2019,January,6,6,Sunday,1,1

# Extract semester

In [43]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,dater_year,date_month,date_days,date_daysofweek,date_dow_name,date_is_weekend,quarter,semester
0,2019-12-10,2019,December,10,1,Tuesday,0,4,2
1,2018-08-15,2018,August,15,2,Wednesday,0,3,2
2,2018-10-23,2018,October,23,1,Tuesday,0,4,2
3,2019-08-17,2019,August,17,5,Saturday,1,3,2
4,2019-01-06,2019,January,6,6,Sunday,1,1,1

Extract Time elapsed between dates

In [46]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 9, 15, 2, 50, 39, 900688)

In [48]:
today - date['date']

0     2106 days 02:50:39.900688
1     2588 days 02:50:39.900688
2     2519 days 02:50:39.900688
3     2221 days 02:50:39.900688
4     2444 days 02:50:39.900688
                 ...
995   2534 days 02:50:39.900688
996   2475 days 02:50:39.900688
997   2323 days 02:50:39.900688
998   2388 days 02:50:39.900688
999   2162 days 02:50:39.900688
Name: date, Length: 1000, dtype: timedelta64[ns]

In [50]:
(today - date['date']).dt.days

0      2106
1      2588
2      2519
3      2221
4      2444
       ...
995    2534
996    2475
997    2323
998    2388
999    2162
Name: date, Length: 1000, dtype: int64

In [62]:
# months passed

np.round((today - date['date']) / np.timedelta64(1,  'ms'), 0)

0      1.819686e+11
1      2.236134e+11
2      2.176518e+11
3      1.919046e+11
4      2.111718e+11
           ...
995    2.189478e+11
996    2.138502e+11
997    2.007174e+11
998    2.063334e+11
999    1.868070e+11
Name: date, Length: 1000, dtype: float64

In [64]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [66]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [68]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [72]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

# Extract time part

In [75]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

# Time differnece

In [78]:
today - time['date']

0     4292 days 02:00:39.900688
1     4156 days 03:10:39.900688
2     4642 days 02:29:39.900688
3     3944 days 02:19:39.900688
4     4341 days 03:39:39.900688
                 ...
995   4931 days 02:00:39.900688
996   4252 days 03:36:39.900688
997   4717 days 03:13:39.900688
998   4833 days 03:16:39.900688
999   4105 days 03:25:39.900688
Name: date, Length: 1000, dtype: timedelta64[ns]

In [80]:
# in Seconds

(today - time['date']) / np.timedelta64(1, 's')

0      3.708360e+08
1      3.590898e+08
2      4.010778e+08
3      3.407700e+08
4      3.750756e+08
           ...
995    4.260456e+08
996    3.673858e+08
997    4.075604e+08
998    4.175830e+08
999    3.546843e+08
Name: date, Length: 1000, dtype: float64

In [82]:
# in minutes

(today - time['date']) / np.timedelta64(1, 'm')

0      6.180601e+06
1      5.984831e+06
2      6.684630e+06
3      5.679500e+06
4      6.251260e+06
           ...
995    7.100761e+06
996    6.123097e+06
997    6.792674e+06
998    6.959717e+06
999    5.911406e+06
Name: date, Length: 1000, dtype: float64

In [84]:
# in hours

(today - time['date']) / np.timedelta64(1, 'h')

0      103010.011084
1       99747.177750
2      111410.494417
3       94658.327750
4      104187.661084
           ...
995    118346.011084
996    102051.611084
997    113211.227750
998    115995.277750
999     98523.427750
Name: date, Length: 1000, dtype: float64